LoadTest/SingleProcess/school1_lec_4_students_chat.txt
Started phase 0, duration: 50s @ 03:06:53(+0530) 2021-08-08
Report @ 03:07:03(+0530) 2021-08-08
Elapsed time: 14 seconds
  Scenarios launched:  9
  Scenarios completed: 0
  Requests completed:  42
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.6
    median: 0
    p95: 0.4
    p99: 0.6
  Codes:
    0: 42
  engine.socketio.emit: 42

Report @ 03:07:13(+0530) 2021-08-08
Elapsed time: 24 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  51
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 1.2
    median: 0
    p95: 0.4
    p99: 1.2
  Codes:
    0: 51
  engine.socketio.emit: 51

Report @ 03:07:23(+0530) 2021-08-08
Elapsed time: 34 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  58
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.6
    median: 0.1
    p95: 0.4
    p99: 0.6
  Codes:
    0: 58
  engine.socketio.emit: 58

Report @ 03:07:33(+0530) 2021-08-08
Elapsed time: 44 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  68
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 1.1
    median: 0.1
    p95: 0.6
    p99: 1
  Codes:
    0: 68
  engine.socketio.emit: 68

Report @ 03:07:43(+0530) 2021-08-08
Elapsed time: 54 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  78
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.9
    median: 0.2
    p95: 0.5
    p99: 0.8
  Codes:
    0: 78
  engine.socketio.emit: 78

Report @ 03:07:53(+0530) 2021-08-08
Elapsed time: 1 minute, 4 seconds
  Scenarios launched:  1
  Scenarios completed: 0
  Requests completed:  42
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.9
    median: 0.3
    p95: 0.5
    p99: 0.9
  Codes:
    0: 42
  engine.socketio.emit: 42

Report @ 03:08:03(+0530) 2021-08-08
Elapsed time: 1 minute, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 4.4
    median: 0.3
    p95: 1.7
    p99: 4.4
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:08:13(+0530) 2021-08-08
Elapsed time: 1 minute, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.3
    median: 0.4
    p95: 0.7
    p99: 2.3
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:08:23(+0530) 2021-08-08
Elapsed time: 1 minute, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.6
    median: 0.3
    p95: 1.8
    p99: 2.6
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:08:33(+0530) 2021-08-08
Elapsed time: 1 minute, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.6
    median: 0.4
    p95: 0.8
    p99: 1.6
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:08:43(+0530) 2021-08-08
Elapsed time: 1 minute, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.8
    median: 0.3
    p95: 0.6
    p99: 0.8
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:08:53(+0530) 2021-08-08
Elapsed time: 2 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 6.6
    median: 0.3
    p95: 1
    p99: 6.6
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:09:03(+0530) 2021-08-08
Elapsed time: 2 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.8
    median: 0.3
    p95: 0.7
    p99: 0.8
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:09:13(+0530) 2021-08-08
Elapsed time: 2 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.7
    median: 0.3
    p95: 0.6
    p99: 0.7
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:09:23(+0530) 2021-08-08
Elapsed time: 2 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.7
    median: 0.3
    p95: 0.6
    p99: 0.7
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:09:33(+0530) 2021-08-08
Elapsed time: 2 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.7
    median: 0.3
    p95: 0.6
    p99: 0.7
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:09:43(+0530) 2021-08-08
Elapsed time: 2 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1
    median: 0.3
    p95: 0.8
    p99: 1
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:09:53(+0530) 2021-08-08
Elapsed time: 3 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.8
    median: 0.3
    p95: 0.6
    p99: 0.8
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:10:03(+0530) 2021-08-08
Elapsed time: 3 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.1
    median: 0.2
    p95: 0.6
    p99: 2.1
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:10:13(+0530) 2021-08-08
Elapsed time: 3 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.3
    median: 0.3
    p95: 0.5
    p99: 2.3
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:10:23(+0530) 2021-08-08
Elapsed time: 3 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.2
    median: 0.3
    p95: 0.6
    p99: 1.2
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:10:33(+0530) 2021-08-08
Elapsed time: 3 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.9
    median: 0.3
    p95: 1.4
    p99: 1.9
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:10:43(+0530) 2021-08-08
Elapsed time: 3 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.3
    p95: 0.5
    p99: 0.6
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:10:53(+0530) 2021-08-08
Elapsed time: 4 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 3.3
    median: 0.3
    p95: 0.5
    p99: 3.3
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:11:03(+0530) 2021-08-08
Elapsed time: 4 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1
    median: 0.3
    p95: 0.8
    p99: 1
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:11:13(+0530) 2021-08-08
Elapsed time: 4 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.8
    median: 0.2
    p95: 0.5
    p99: 0.8
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:11:23(+0530) 2021-08-08
Elapsed time: 4 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.3
    p95: 0.5
    p99: 0.6
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:11:33(+0530) 2021-08-08
Elapsed time: 4 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.1
    median: 0.2
    p95: 0.5
    p99: 2.1
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:11:43(+0530) 2021-08-08
Elapsed time: 4 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.3
    median: 0.2
    p95: 0.8
    p99: 2.3
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:11:53(+0530) 2021-08-08
Elapsed time: 5 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  38
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.6
    median: 0.3
    p95: 1
    p99: 2.6
  Codes:
    0: 38
  engine.socketio.emit: 38

Report @ 03:12:03(+0530) 2021-08-08
Elapsed time: 5 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 9
  Requests completed:  32
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 3.4
    median: 0.2
    p95: 2.5
    p99: 3.4
  Codes:
    0: 32
  engine.socketio.emit: 32

Report @ 03:12:13(+0530) 2021-08-08
Elapsed time: 5 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  27
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.3
    p95: 0.5
    p99: 0.6
  Codes:
    0: 27
  engine.socketio.emit: 27

Report @ 03:12:23(+0530) 2021-08-08
Elapsed time: 5 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.5
    median: 0.2
    p95: 0.5
    p99: 0.5
  Codes:
    0: 20
  engine.socketio.emit: 20

Report @ 03:12:33(+0530) 2021-08-08
Elapsed time: 5 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.4
    median: 0.2
    p95: 0.4
    p99: 0.4
  Codes:
    0: 10
  engine.socketio.emit: 10

Report @ 03:12:43(+0530) 2021-08-08
Elapsed time: 5 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 03:12:43(+0530) 2021-08-08
Elapsed time: 5 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 1
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 03:12:43(+0530) 2021-08-08
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  1340
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 6.6
    median: 0.3
    p95: 0.6
    p99: 2.1
  Scenario counts:
    Silent students: 12 (24%)
    Students with lecture doubts: 38 (76%)
  Codes:
    0: 1340
  engine.socketio.emit: 1340